Revit 2026 API

# SKPImportOptions(SKPImportOptions) Constructor

---

Constructs a new instance of SKPImportOptions as a copy of the import options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SKPImportOptions(
	SKPImportOptions option
)
```
```vb
Public Sub New (
	option As SKPImportOptions
)
```
```cpp
public:
SKPImportOptions(
	SKPImportOptions^ option
)
```
```fsharp
new :
        option : SKPImportOptions -> SKPImportOptions
```

#### Parameters

option SKPImportOptions
     The SKP options to be copied.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

SKPImportOptions Class

SKPImportOptions Overload

Autodesk.Revit.DB Namespace